alambe94/STM32_Ethernet/STM32_FreeRTOS_TCP_00/Middlewares/Third_Party/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Fxx/NetworkInterface.c
/*
 * Value for the 'PHY_REG_00_BMCR', the PHY's Basic mode control register
 */
#define BMCR_FULLDPLX 0x0100  // Full duplex
#define BMCR_ANRESTART 0x0200 // Auto negotiation restart
#define BMCR_ANENABLE 0x1000  // Enable auto negotiation
#define BMCR_SPEED100 0x2000  // Select 100Mbps
#define BMCR_RESET 0x8000	  // Reset the PHY

#define PHYCR_MDIX_EN 0x8000	// Enable Auto MDIX
#define PHYCR_MDIX_FORCE 0x4000 // Force MDIX crossed

/*
 * Most users will want a PHY that negotiates about
 * the connection properties: speed, dmix and duplex.
 */

#if !defined(ipconfigETHERNET_AN_ENABLE)
/* Enable auto-negotiation */
#define ipconfigETHERNET_AN_ENABLE 1
#endif

#if !defined(ipconfigETHERNET_AUTO_CROSS_ENABLE)
#define ipconfigETHERNET_AUTO_CROSS_ENABLE 1
#endif

#if (ipconfigETHERNET_AN_ENABLE == 0)
/*
     * The following three defines are only used in case there
     * is no auto-negotiation.
     */
#if !defined(ipconfigETHERNET_CROSSED_LINK)
#define ipconfigETHERNET_CROSSED_LINK 1
#endif

#if !defined(ipconfigETHERNET_USE_100MB)
#define ipconfigETHERNET_USE_100MB 1
#endif

#if !defined(ipconfigETHERNET_USE_FULL_DUPLEX)
#define ipconfigETHERNET_USE_FULL_DUPLEX 1
#endif
#endif /* ipconfigETHERNET_AN_ENABLE == 0 */

/* Default the size of the stack used by the EMAC deferred handler task to twice
the size of the stack used by the idle task - but allow this to be overridden in
FreeRTOSConfig.h as configMINIMAL_STACK_SIZE is a user definable constant. */
#ifndef configEMAC_TASK_STACK_SIZE
#define configEMAC_TASK_STACK_SIZE (2 * configMINIMAL_STACK_SIZE)
#endif

/*-----------------------------------------------------------*/

/*
 * A deferred interrupt handler task that processes
 */
static void prvEMACHandlerTask(void *pvParameters);

/*
 * Force a negotiation with the Switch or Router and wait for LS.
 */
static void prvEthernetUpdateConfig(BaseType_t xForce);

/*
 * See if there is a new packet and forward it to the IP-task.
 */
static BaseType_t prvNetworkInterfaceInput(void);

#if (ipconfigUSE_LLMNR != 0)
/*
     * For LLMNR, an extra MAC-address must be configured to
     * be able to receive the multicast messages.
     */
static void prvMACAddressConfig(ETH_HandleTypeDef *heth, uint32_t ulIndex, uint8_t *Addr);
#endif

/*-----------------------------------------------------------*/

typedef struct _PhyProperties_t
{
    uint8_t speed;
    uint8_t mdix;
    uint8_t duplex;
    uint8_t spare;
} PhyProperties_t;

/* Bit map of outstanding ETH interrupt events for processing.  Currently only
the Rx interrupt is handled, although code is included for other events to
enable future expansion. */
static volatile uint32_t ulISREvents;

/* A copy of PHY register 1: 'PHY_REG_01_BMSR' */
static uint32_t ulPHYLinkStatus = 0;

#if (ipconfigUSE_LLMNR == 1)
static const uint8_t xLLMNR_MACAddress[] = {0x01, 0x00, 0x5E, 0x00, 0x00, 0xFC};
#endif

/* Ethernet handle. */
extern ETH_HandleTypeDef heth;

/* Value to be written into the 'Basic mode Control Register'. */
static uint32_t ulBCRvalue;

/* Value to be written into the 'Advertisement Control Register'. */
static uint32_t ulACRValue;

/* ucMACAddress as it appears in main.c */
extern const uint8_t ucMACAddress[6];

/* Holds the handle of the task used as a deferred interrupt processor.  The
handle is used so direct notifications can be sent to the task for all EMAC/DMA
related interrupts. */
static TaskHandle_t xEMACTaskHandle = NULL;

/* For local use only: describe the PHY's properties: */
const PhyProperties_t xPHYProperties =
    {
#if (ipconfigETHERNET_AN_ENABLE != 0)
        .speed = PHY_SPEED_AUTO,
        .duplex = PHY_DUPLEX_AUTO,
#else
#if (ipconfigETHERNET_USE_100MB != 0)
        .speed = PHY_SPEED_100,
#else
        .speed = PHY_SPEED_10,
#endif

#if (ipconfigETHERNET_USE_FULL_DUPLEX != 0)
        .duplex = PHY_DUPLEX_FULL,
#else
        .duplex = PHY_DUPLEX_HALF,
#endif
#endif

#if (ipconfigETHERNET_AN_ENABLE != 0) && (ipconfigETHERNET_AUTO_CROSS_ENABLE != 0)
        .mdix = PHY_MDIX_AUTO,
#elif (ipconfigETHERNET_CROSSED_LINK != 0)
        .mdix = PHY_MDIX_CROSSED,
#else
        .mdix = PHY_MDIX_DIRECT,
#endif
};

/* MAC buffers: ---------------------------------------------------------*/
__ALIGN_BEGIN ETH_DMADescTypeDef DMARxDscrTab[ETH_RXBUFNB] __ALIGN_END;	 /* Ethernet Rx MA Descriptor */
__ALIGN_BEGIN ETH_DMADescTypeDef DMATxDscrTab[ETH_TXBUFNB] __ALIGN_END;	 /* Ethernet Tx DMA Descriptor */
__ALIGN_BEGIN uint8_t Rx_Buff[ETH_RXBUFNB][ETH_RX_BUF_SIZE] __ALIGN_END; /* Ethernet Receive Buffer */
__ALIGN_BEGIN uint8_t Tx_Buff[ETH_TXBUFNB][ETH_TX_BUF_SIZE] __ALIGN_END; /* Ethernet Transmit Buffer */

/*-----------------------------------------------------------*/

void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
    BaseType_t xHigherPriorityTaskWoken = 0;

    /* Ethernet RX-Complete callback function, elsewhere declared as weak. */
    ulISREvents |= EMAC_IF_RX_EVENT;
    if (xEMACTaskHandle != NULL)
    {
        vTaskNotifyGiveFromISR(xEMACTaskHandle, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}
/*-----------------------------------------------------------*/

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth)
{
    /* This call-back would only be useful in case packets are being sent
    zero-copy.  Once they're sent, the buffers must be released. */
}
/*-----------------------------------------------------------*/

BaseType_t xNetworkInterfaceInitialise(void)
{
    HAL_StatusTypeDef hal_eth_init_status;

    if (xEMACTaskHandle == NULL)
    {
        /* Initialise ETH */

        heth.Instance = ETH;
        heth.Init.AutoNegotiation = ETH_AUTONEGOTIATION_ENABLE;
        heth.Init.Speed = ETH_SPEED_10M;
        heth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
        heth.Init.PhyAddress = 1;

        heth.Init.MACAddr = (uint8_t *)ucMACAddress;
        heth.Init.RxMode = ETH_RXINTERRUPT_MODE;

        /* using the ETH_CHECKSUM_BY_HARDWARE option:
        both the IP and the protocol checksums will be calculated
        by the peripheral. */
        heth.Init.ChecksumMode = ETH_CHECKSUM_BY_HARDWARE;

        heth.Init.MediaInterface = ETH_MEDIA_INTERFACE_RMII;
        hal_eth_init_status = HAL_ETH_Init(&heth);

        /* Only for inspection by debugger. */
        (void)hal_eth_init_status;

        __HAL_ETH_DMA_ENABLE_IT(&heth, ETH_DMA_ALL_INTS);

