alambe94/STM32_Ethernet/STM32_FreeRTOS_TCP_00/Middlewares/Third_Party/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Fxx/NetworkInterface.c
        /* Initialize Tx Descriptors list: Chain Mode */
        HAL_ETH_DMATxDescListInit(&heth, DMATxDscrTab, Tx_Buff[0], ETH_TXBUFNB);

        /* Initialize Rx Descriptors list: Chain Mode  */
        HAL_ETH_DMARxDescListInit(&heth, DMARxDscrTab, Rx_Buff[0], ETH_RXBUFNB);

#if (ipconfigUSE_LLMNR != 0)
        {
            /* Program the LLMNR address at index 1. */
            prvMACAddressConfig(&heth, ETH_MAC_ADDRESS1, (uint8_t *)xLLMNR_MACAddress);
        }
#endif

        /* Force a negotiation with the Switch or Router and wait for LS. */
        prvEthernetUpdateConfig(pdTRUE);

        /* The deferred interrupt handler task is created at the highest
        possible priority to ensure the interrupt handler can return directly
        to it.  The task's handle is stored in xEMACTaskHandle so interrupts can
        notify the task when there is something to process. */
        xTaskCreate(prvEMACHandlerTask, "EMAC", configEMAC_TASK_STACK_SIZE, NULL, configMAX_PRIORITIES - 1, &xEMACTaskHandle);
    }
    /* When returning non-zero, the stack will become active and
    start DHCP (in configured) */
    return (ulPHYLinkStatus & BMSR_LINK_STATUS) != 0;
}
/*-----------------------------------------------------------*/

static void prvMACAddressConfig(ETH_HandleTypeDef *heth, uint32_t ulIndex, uint8_t *Addr)
{
    uint32_t ulTempReg;

    /* Calculate the selected MAC address high register. */
    ulTempReg = 0x80000000ul | ((uint32_t)Addr[5] << 8) | (uint32_t)Addr[4];

    /* Load the selected MAC address high register. */
    (*(__IO uint32_t *)((uint32_t)(ETH_MAC_ADDR_HBASE + ulIndex))) = ulTempReg;

    /* Calculate the selected MAC address low register. */
    ulTempReg = ((uint32_t)Addr[3] << 24) | ((uint32_t)Addr[2] << 16) | ((uint32_t)Addr[1] << 8) | Addr[0];

    /* Load the selected MAC address low register */
    (*(__IO uint32_t *)((uint32_t)(ETH_MAC_ADDR_LBASE + ulIndex))) = ulTempReg;
}
/*-----------------------------------------------------------*/

BaseType_t xNetworkInterfaceOutput(xNetworkBufferDescriptor_t *const pxDescriptor,
	                           BaseType_t bReleaseAfterSend)
{
    BaseType_t xReturn;
    uint32_t ulTransmitSize = 0;
    __IO ETH_DMADescTypeDef *pxDmaTxDesc;

#if (ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM != 0)
    {
        ProtocolPacket_t *pxPacket;

        /* If the peripheral must calculate the checksum, it wants
        the protocol checksum to have a value of zero. */
        pxPacket = (ProtocolPacket_t *)(pxDescriptor->pucEthernetBuffer);

        if (pxPacket->xICMPPacket.xIPHeader.ucProtocol == ipPROTOCOL_ICMP)
        {
            pxPacket->xICMPPacket.xICMPHeader.usChecksum = (uint16_t)0u;
        }
    }
#endif

    if ((ulPHYLinkStatus & BMSR_LINK_STATUS) != 0)
    {
        /* This function does the actual transmission of the packet. The packet is
        contained in 'pxDescriptor' that is passed to the function. */
        pxDmaTxDesc = heth.TxDesc;

        /* Is this buffer available? */
        if ((pxDmaTxDesc->Status & ETH_DMATXDESC_OWN) != 0)
        {
            xReturn = pdFAIL;
        }
        else
        {
            /* Get bytes in current buffer. */
            ulTransmitSize = pxDescriptor->xDataLength;

            if (ulTransmitSize > ETH_TX_BUF_SIZE)
            {
                ulTransmitSize = ETH_TX_BUF_SIZE;
            }

            /* Copy the remaining bytes */
            memcpy((void *)pxDmaTxDesc->Buffer1Addr, pxDescriptor->pucEthernetBuffer, ulTransmitSize);

            /* Prepare transmit descriptors to give to DMA. */
            HAL_ETH_TransmitFrame(&heth, ulTransmitSize);

            iptraceNETWORK_INTERFACE_TRANSMIT();
            xReturn = pdPASS;
        }
    }
    else
    {
        /* The PHY has no Link Status, packet shall be dropped. */
        xReturn = pdFAIL;
    }

#if (ipconfigZERO_COPY_TX_DRIVER == 0)
    {
        /* The buffer has been sent so can be released. */
        if (bReleaseAfterSend != pdFALSE)
        {
            vReleaseNetworkBufferAndDescriptor(pxDescriptor);
        }
    }
#endif

    return xReturn;
}
/*-----------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput(void)
{
    xNetworkBufferDescriptor_t *pxDescriptor;
    uint16_t usReceivedLength;
    __IO ETH_DMADescTypeDef *xDMARxDescriptor;
    uint32_t ulSegCount;
    xIPStackEvent_t xRxEvent = {eNetworkRxEvent, NULL};
    const TickType_t xDescriptorWaitTime = pdMS_TO_TICKS(250);

    /* get received frame */
    if (HAL_ETH_GetReceivedFrame(&heth) != HAL_OK)
    {
        usReceivedLength = 0;
    }
    else
    {
        /* Obtain the size of the packet and put it into the "usReceivedLength" variable. */
        usReceivedLength = heth.RxFrameInfos.length;

        if (usReceivedLength > 0)
        {
            /* Create a buffer of the required length. */
            pxDescriptor = pxGetNetworkBufferWithDescriptor(usReceivedLength, xDescriptorWaitTime);

            if (pxDescriptor != NULL)
            {
                xDMARxDescriptor = heth.RxFrameInfos.FSRxDesc;

                /* Copy remaining data. */
                if (usReceivedLength > pxDescriptor->xDataLength)
                {
                    usReceivedLength = pxDescriptor->xDataLength;
                }

                memcpy(pxDescriptor->pucEthernetBuffer, (uint8_t *)heth.RxFrameInfos.buffer, usReceivedLength);

                xRxEvent.pvData = (void *)pxDescriptor;

                /* Pass the data to the TCP/IP task for processing. */
                if (xSendEventStructToIPTask(&xRxEvent, xDescriptorWaitTime) == pdFALSE)
                {
                    /* Could not send the descriptor into the TCP/IP stack, it
                    must be released. */
                    vReleaseNetworkBufferAndDescriptor(pxDescriptor);
                    iptraceETHERNET_RX_EVENT_LOST();
                }
                else
                {
                    iptraceNETWORK_INTERFACE_RECEIVE();
                }

                /* Release descriptors to DMA.  Point to first descriptor. */
                xDMARxDescriptor = heth.RxFrameInfos.FSRxDesc;
                ulSegCount = heth.RxFrameInfos.SegCount;

                /* Set Own bit in RX descriptors: gives the buffers back to DMA. */
                while (ulSegCount != 0)
                {
                    xDMARxDescriptor->Status |= ETH_DMARXDESC_OWN;
                    xDMARxDescriptor = (ETH_DMADescTypeDef *)xDMARxDescriptor->Buffer2NextDescAddr;
                    ulSegCount--;
                }

                /* Clear Segment_Count */
                heth.RxFrameInfos.SegCount = 0;
            }
            else
            {
                FreeRTOS_printf(("prvNetworkInterfaceInput: pxGetNetworkBuffer failed length %u\n", usReceivedLength));
            }
        }
        else
        {
            FreeRTOS_printf(("prvNetworkInterfaceInput: zero-sized packet?\n"));
            pxDescriptor = NULL;
        }

        /* When Rx Buffer unavailable flag is set clear it and resume
        reception. */
        if ((heth.Instance->DMASR & ETH_DMASR_RBUS) != 0)
        {
            /* Clear RBUS ETHERNET DMA flag. */
            heth.Instance->DMASR = ETH_DMASR_RBUS;

            /* Resume DMA reception. */
            heth.Instance->DMARPDR = 0;
        }
    }

