alambe94/STM32_Ethernet/STM32_FreeRTOS_TCP_00/Middlewares/Third_Party/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Fxx/NetworkInterface.c
    return (usReceivedLength > 0);
}
/*-----------------------------------------------------------*/

void vMACBProbePhy(void)
{
    uint32_t ulPhyControl, ulConfig, ulAdvertise, ulLower, ulUpper, ulMACPhyID, ulValue;
    TimeOut_t xPhyTime;
    TickType_t xRemTime = 0;

    HAL_ETH_ReadPHYRegister(&heth, PHY_REG_03_PHYSID2, &ulLower);
    HAL_ETH_ReadPHYRegister(&heth, PHY_REG_02_PHYSID1, &ulUpper);

    ulMACPhyID = ((ulUpper << 16) & 0xFFFF0000) | (ulLower & 0xFFF0);

    /* The expected ID for the 'DP83848I' is 0x20005C90. */
    FreeRTOS_printf(("PHY ID %lu\n", ulMACPhyID));

    /* Remove compiler warning if FreeRTOS_printf() is not defined. */
    (void)ulMACPhyID;

    /* Set advertise register. */
    if ((xPHYProperties.speed == PHY_SPEED_AUTO) && (xPHYProperties.duplex == PHY_DUPLEX_AUTO))
    {
        ulAdvertise = ADVERTISE_CSMA | ADVERTISE_ALL;
        /* Reset auto-negotiation capability. */
    }
    else
    {
        ulAdvertise = ADVERTISE_CSMA;

        if (xPHYProperties.speed == PHY_SPEED_AUTO)
        {
            if (xPHYProperties.duplex == PHY_DUPLEX_FULL)
            {
                ulAdvertise |= ADVERTISE_10FULL | ADVERTISE_100FULL;
            }
            else
            {
                ulAdvertise |= ADVERTISE_10HALF | ADVERTISE_100HALF;
            }
        }
        else if (xPHYProperties.duplex == PHY_DUPLEX_AUTO)
        {
            if (xPHYProperties.speed == PHY_SPEED_10)
            {
                ulAdvertise |= ADVERTISE_10FULL | ADVERTISE_10HALF;
            }
            else
            {
                ulAdvertise |= ADVERTISE_100FULL | ADVERTISE_100HALF;
            }
        }
        else if (xPHYProperties.speed == PHY_SPEED_100)
        {
            if (xPHYProperties.duplex == PHY_DUPLEX_FULL)
            {
                ulAdvertise |= ADVERTISE_100FULL;
            }
            else
            {
                ulAdvertise |= ADVERTISE_100HALF;
            }
        }
        else
        {
            if (xPHYProperties.duplex == PHY_DUPLEX_FULL)
            {
                ulAdvertise |= ADVERTISE_10FULL;
            }
            else
            {
                ulAdvertise |= ADVERTISE_10HALF;
            }
        }
    }

    /* Read Control register. */
    HAL_ETH_ReadPHYRegister(&heth, PHY_REG_00_BMCR, &ulConfig);

    HAL_ETH_WritePHYRegister(&heth, PHY_REG_00_BMCR, ulConfig | BMCR_RESET);
    xRemTime = (TickType_t)pdMS_TO_TICKS(1000UL);
    vTaskSetTimeOutState(&xPhyTime);

    for (;;)
    {
        HAL_ETH_ReadPHYRegister(&heth, PHY_REG_00_BMCR, &ulValue);
        if ((ulValue & BMCR_RESET) == 0)
        {
            FreeRTOS_printf(("BMCR_RESET ready\n"));
            break;
        }
        if (xTaskCheckForTimeOut(&xPhyTime, &xRemTime) != pdFALSE)
        {
            FreeRTOS_printf(("BMCR_RESET timed out\n"));
            break;
        }
    }
    HAL_ETH_WritePHYRegister(&heth, PHY_REG_00_BMCR, ulConfig & ~BMCR_RESET);

    vTaskDelay(pdMS_TO_TICKS(50ul));

    /* Write advertise register. */
    HAL_ETH_WritePHYRegister(&heth, PHY_REG_04_ADVERTISE, ulAdvertise);

    /*
            AN_EN        AN1         AN0       Forced Mode
              0           0           0        10BASE-T, Half-Duplex
              0           0           1        10BASE-T, Full-Duplex
              0           1           0        100BASE-TX, Half-Duplex
              0           1           1        100BASE-TX, Full-Duplex
            AN_EN        AN1         AN0       Advertised Mode
              1           0           0        10BASE-T, Half/Full-Duplex
              1           0           1        100BASE-TX, Half/Full-Duplex
              1           1           0        10BASE-T Half-Duplex
                                               100BASE-TX, Half-Duplex
              1           1           1        10BASE-T, Half/Full-Duplex
                                               100BASE-TX, Half/Full-Duplex
    */

    /* Read Control register. */
    HAL_ETH_ReadPHYRegister(&heth, PHY_REG_00_BMCR, &ulConfig);

    ulConfig &= ~(BMCR_ANRESTART | BMCR_ANENABLE | BMCR_SPEED100 | BMCR_FULLDPLX);

    /* HT 12/9/14: always set AN-restart and AN-enable, even though the choices
    are limited. */
    ulConfig |= (BMCR_ANRESTART | BMCR_ANENABLE);

    if (xPHYProperties.speed == PHY_SPEED_100)
    {
        ulConfig |= BMCR_SPEED100;
    }
    else if (xPHYProperties.speed == PHY_SPEED_10)
    {
        ulConfig &= ~BMCR_SPEED100;
    }

    if (xPHYProperties.duplex == PHY_DUPLEX_FULL)
    {
        ulConfig |= BMCR_FULLDPLX;
    }
    else if (xPHYProperties.duplex == PHY_DUPLEX_HALF)
    {
        ulConfig &= ~BMCR_FULLDPLX;
    }

    /* Read PHY Control register. */
    HAL_ETH_ReadPHYRegister(&heth, PHY_REG_19_PHYCR, &ulPhyControl);

    /* Clear bits which might get set: */
    ulPhyControl &= ~(PHYCR_MDIX_EN | PHYCR_MDIX_FORCE);

    if (xPHYProperties.mdix == PHY_MDIX_AUTO)
    {
        ulPhyControl |= PHYCR_MDIX_EN;
    }
    else if (xPHYProperties.mdix == PHY_MDIX_CROSSED)
    {
        /* Force direct link = Use crossed RJ45 cable. */
        ulPhyControl &= ~PHYCR_MDIX_FORCE;
    }
    else
    {
        /* Force crossed link = Use direct RJ45 cable. */
        ulPhyControl |= PHYCR_MDIX_FORCE;
    }
    /* update PHY Control Register. */
    HAL_ETH_WritePHYRegister(&heth, PHY_REG_19_PHYCR, ulPhyControl);

    FreeRTOS_printf(("+TCP: advertise: %lX config %lX\n", ulAdvertise, ulConfig));

    /* Now the two values to global values for later use. */
    ulBCRvalue = ulConfig;
    ulACRValue = ulAdvertise;
}
/*-----------------------------------------------------------*/

static void prvEthernetUpdateConfig(BaseType_t xForce)
{
    __IO uint32_t ulTimeout = 0;
    uint32_t ulRegValue = 0;

    FreeRTOS_printf(("prvEthernetUpdateConfig: LS %i Force %li\n",
                     (ulPHYLinkStatus & BMSR_LINK_STATUS) != 0,
                     xForce));

    if ((xForce != pdFALSE) || ((ulPHYLinkStatus & BMSR_LINK_STATUS) != 0))
    {
        /* Restart the auto-negotiation. */
        if (heth.Init.AutoNegotiation != ETH_AUTONEGOTIATION_DISABLE)
        {
            /* Enable Auto-Negotiation. */
            HAL_ETH_WritePHYRegister(&heth, PHY_BCR, ulBCRvalue | BMCR_ANRESTART);
            HAL_ETH_WritePHYRegister(&heth, PHY_REG_04_ADVERTISE, ulACRValue);

            /* Wait until the auto-negotiation will be completed */
            do
            {
                ulTimeout++;
                HAL_ETH_ReadPHYRegister(&heth, PHY_REG_01_BMSR, &ulRegValue);
            } while (((ulRegValue & PHY_AUTONEGO_COMPLETE) == 0) && (ulTimeout < PHY_READ_TO));

            HAL_ETH_WritePHYRegister(&heth, PHY_BCR, ulBCRvalue & ~BMCR_ANRESTART);

            if (ulTimeout < PHY_READ_TO)
            {
                /* Reset Timeout counter. */
                ulTimeout = 0;

                /* Read the result of the auto-negotiation. */
                HAL_ETH_ReadPHYRegister(&heth, PHY_SR, &ulRegValue);
                if ((ulRegValue & PHY_LINK_STATUS) != 0)
                {
                    ulPHYLinkStatus |= BMSR_LINK_STATUS;
                }
                else
                {
                    ulPHYLinkStatus &= ~(BMSR_LINK_STATUS);
                }

                FreeRTOS_printf((">> Autonego ready: %08li: %s duplex %u mbit %s status\n",
                                 ulRegValue,
                                 (ulRegValue & PHY_DUPLEX_STATUS) ? "full" : "half",
                                 (ulRegValue & PHY_SPEED_STATUS) ? 10 : 100,
                                 (ulRegValue & PHY_LINK_STATUS) ? "high" : "low"));

                /* Configure the MAC with the Duplex Mode fixed by the
                auto-negotiation process. */
                if ((ulRegValue & PHY_DUPLEX_STATUS) != (uint32_t)RESET)
                {
                    /* Set Ethernet duplex mode to Full-duplex following the
                    auto-negotiation. */
                    heth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
                }
                else
                {
                    /* Set Ethernet duplex mode to Half-duplex following the
                    auto-negotiation. */
                    heth.Init.DuplexMode = ETH_MODE_HALFDUPLEX;
                }

                /* Configure the MAC with the speed fixed by the
                auto-negotiation process. */
                if ((ulRegValue & PHY_SPEED_STATUS) != 0)
                {
                    /* Set Ethernet speed to 10M following the
                    auto-negotiation. */
                    heth.Init.Speed = ETH_SPEED_10M;
                }
                else
                {
                    /* Set Ethernet speed to 100M following the
                    auto-negotiation. */
                    heth.Init.Speed = ETH_SPEED_100M;
                }
            } /* if( ulTimeout < PHY_READ_TO ) */
        }
        else /* AutoNegotiation Disable */
        {
            uint16_t usValue;

            /* Check parameters */
            assert_param(IS_ETH_SPEED(heth.Init.Speed));
            assert_param(IS_ETH_DUPLEX_MODE(heth.Init.DuplexMode));

            /* Set MAC Speed and Duplex Mode to PHY */
            usValue = (uint16_t)(heth.Init.DuplexMode >> 3) | (uint16_t)(heth.Init.Speed >> 1);
            HAL_ETH_WritePHYRegister(&heth, PHY_BCR, usValue);
        }

        /* ETHERNET MAC Re-Configuration */
        HAL_ETH_ConfigMAC(&heth, (ETH_MACInitTypeDef *)NULL);

        /* Restart MAC interface */
        HAL_ETH_Start(&heth);

        FreeRTOS_printf(("MACCR = %08li DMABMR = %08li\n",
                         heth.Instance->MACCR,
                         heth.Instance->DMABMR));
    }
    else
    {
        /* Stop MAC interface */
        HAL_ETH_Stop(&heth);
    }
}
/*-----------------------------------------------------------*/

BaseType_t xGetPhyLinkStatus(void)
{
    BaseType_t xReturn;

    if ((ulPHYLinkStatus & BMSR_LINK_STATUS) != 0)
    {
        xReturn = pdPASS;
    }
    else
    {
        xReturn = pdFAIL;
    }

    return xReturn;
}
/*-----------------------------------------------------------*/

static void prvEMACHandlerTask(void *pvParameters)
{
    TimeOut_t xPhyTime;
    TickType_t xPhyRemTime;
    UBaseType_t uxLastMinBufferCount = 0;
    UBaseType_t uxCurrentCount;
    BaseType_t xResult = 0;
    uint32_t xStatus;
    const TickType_t ulMaxBlockTime = pdMS_TO_TICKS(100UL);

    /* Remove compiler warnings about unused parameters. */
    (void)pvParameters;

    vTaskSetTimeOutState(&xPhyTime);
    xPhyRemTime = pdMS_TO_TICKS(PHY_LS_LOW_CHECK_TIME_MS);

    for (;;)
    {
        uxCurrentCount = uxGetMinimumFreeNetworkBuffers();
        if (uxLastMinBufferCount != uxCurrentCount)
        {
            /* The logging produced below may be helpful
            while tuning +TCP: see how many buffers are in use. */
            uxLastMinBufferCount = uxCurrentCount;
            FreeRTOS_printf(("Network buffers: %lu lowest %lu\n",
                             uxGetNumberOfFreeNetworkBuffers(), uxCurrentCount));
        }

