alambe94/STM32_Ethernet/STM32_FreeRTOS_TCP_00/Middlewares/Third_Party/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32Fxx/NetworkInterface.c
#if (ipconfigCHECK_IP_QUEUE_SPACE != 0)
        {
            uxCurrentCount = uxGetMinimumIPQueueSpace();
            if (uxLastMinQueueSpace != uxCurrentCount)
            {
                /* The logging produced below may be helpful
                while tuning +TCP: see how many buffers are in use. */
                uxLastMinQueueSpace = uxCurrentCount;
                FreeRTOS_printf(("Queue space: lowest %lu\n", uxCurrentCount));
            }
        }
#endif /* ipconfigCHECK_IP_QUEUE_SPACE */

        if ((ulISREvents & EMAC_IF_ALL_EVENT) == 0)
        {
            /* No events to process now, wait for the next. */
            ulTaskNotifyTake(pdFALSE, ulMaxBlockTime);
        }

        if ((ulISREvents & EMAC_IF_RX_EVENT) != 0)
        {
            ulISREvents &= ~EMAC_IF_RX_EVENT;

            xResult = prvNetworkInterfaceInput();
            if (xResult > 0)
            {
                while (prvNetworkInterfaceInput() > 0)
                {
                }
            }
        }

        if ((ulISREvents & EMAC_IF_TX_EVENT) != 0)
        {
            /* Future extension: code to release TX buffers if zero-copy is used. */
            ulISREvents &= ~EMAC_IF_TX_EVENT;
        }

        if ((ulISREvents & EMAC_IF_ERR_EVENT) != 0)
        {
            /* Future extension: logging about errors that occurred. */
            ulISREvents &= ~EMAC_IF_ERR_EVENT;
        }

        if (xResult > 0)
        {
            /* A packet was received. No need to check for the PHY status now,
            but set a timer to check it later on. */
            vTaskSetTimeOutState(&xPhyTime);
            xPhyRemTime = pdMS_TO_TICKS(PHY_LS_HIGH_CHECK_TIME_MS);
            xResult = 0;
        }
        else if (xTaskCheckForTimeOut(&xPhyTime, &xPhyRemTime) != pdFALSE)
        {
            HAL_ETH_ReadPHYRegister(&heth, PHY_REG_01_BMSR, &xStatus);
            if ((ulPHYLinkStatus & BMSR_LINK_STATUS) != (xStatus & BMSR_LINK_STATUS))
            {
                ulPHYLinkStatus = xStatus;
                FreeRTOS_printf(("prvEMACHandlerTask: PHY LS now %d\n", (ulPHYLinkStatus & BMSR_LINK_STATUS) != 0));
                prvEthernetUpdateConfig(pdFALSE);
            }

            vTaskSetTimeOutState(&xPhyTime);
            if ((ulPHYLinkStatus & BMSR_LINK_STATUS) != 0)
            {
                xPhyRemTime = pdMS_TO_TICKS(PHY_LS_HIGH_CHECK_TIME_MS);
            }
            else
            {
                xPhyRemTime = pdMS_TO_TICKS(PHY_LS_LOW_CHECK_TIME_MS);
            }
        }
    }
}
/*-----------------------------------------------------------*/

/*
void ETH_IRQHandler(void)
{
    HAL_ETH_IRQHandler(&heth);
}
*/
